In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt 
dataset=load_dataset('lukebarousse/data_jobs')
df=dataset['train'].to_pandas()
df['job_posted_date']=pd.to_datetime(df['job_posted_date'])

In [8]:
median_salary_year=df['salary_year_avg'].median()

In [7]:
median_salary_hour=df['salary_hour_avg'].median()

In [23]:
# to keep our original dataframe intact we assing to another variable
# this assignment causes change in original dataset! this problem can be handled by making copy of our datafram
#Thats done in next chap 3, now lets move forward 
df_filled=df
# to fill NaN values
df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [15]:
#checking above code
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [19]:
# Again we create a new dataframe
df_unique=df_filled
# to drop duplicates
df_unique=df_unique.drop_duplicates()
# to check how many rows we droped
print('Length of original df:',len(df_filled))
print('Length of drop duplicates df:',len(df_unique))
print('Rows dropped:',len(df_filled)-len(df_unique))

Length of original df: 785741
Length of drop duplicates df: 785640
Rows dropped: 101

In [ ]:
# To drop repetative jobs from same comapany
df_unique=df_unique.drop_duplicates(subset=['job_title','company_name'])
print('Length of original df:',len(df_filled))
print('Length of drop duplicates df:',len(df_unique))
print('Rows dropped:',len(df_filled)-len(df_unique))

Length of original df: 785741
Length of drop duplicates df: 508042
Rows dropped: 277699

0         45.98
1         45.98
2         45.98
3         45.98
4         45.98
          ...
785736    45.98
785737    45.98
785738    45.98
785739    45.98
785740    45.98
Name: salary_hour_avg, Length: 785741, dtype: float64